




##################### if #####################

# Оператор if используется, чтобы проверить какое-то условие.
# Если условие истинно (то есть True), то выполняется блок кода внутри этого оператора


# x = 5
# if x > 3:
#     print("x больше 3")  # Это условие истинно, потому что 5 больше 3


################################# elif #########################


# Оператор elif — это сокращение от "else if" (иначе если). Он используется, если первое условие
# if не выполнено (то есть условие ложно), и ты хочешь проверить другое условие. Ты можешь
# использовать несколько elif подряд, чтобы проверить несколько условий.

# пример

# x = 7
# if x > 10:
#     print("x больше 10")
# elif x > 5:
#     print("x больше 5, но меньше или равно 10")  # Это условие истинно, потому что 7 > 5, но 7 не больше 10





################################# else ###############################


# Оператор else используется для выполнения блока кода, если все предыдущие условия (if и
# elif) не были выполнены (то есть они все ложны). Блок кода внутри else выполняется только
# тогда, когда все условия до этого не подошли.

# пример

# x = 3
# if x > 5:
#     print("x больше 5")
# elif x > 3:
#     print("x больше 3, но меньше или равно 5")
# else:
#     print("x меньше или равно 3")  # Это условие выполнится, потому что x не больше 5 и не больше 3





# x = 15
#
# if x > 20:
#     print("x больше 20")
# elif x > 10:
#     print("x больше 10, но меньше или равно 20")  # Выполняется этот блок, потому что 15 > 10, но 15 не больше 20
# elif x > 5:
#     print("x больше 5, но меньше или равно 10")
# else:
#     print("x меньше или равно 5")


#
# age = 17
#
# if age < 13:
#     print("Ты ребенок")
# elif age < 18:
#     print("Ты подросток")
# else:
#     print("Ты взрослый")


#
# age = int(input("Введите ваш возраст: "))
#
#
# if age < 13:
#     print("Ты ребёнок")
# elif 13 <= age <= 19:
#     print("Ты подросток")
# elif 20 <= age <= 64:
#     print("Ты взрослый")
# else:
#     print("Ты пожилой человек")






